// Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for найдите сумму элементов этого массива. Запишите ее в переменную result
//
// const a =[1, 2, 3, 4, 5,5]
// let to = 0
// for(let i = 0; i < a.length;i++ ){
//     to += a[i]
//
// }
// console.log(to)

// 3) Дан массив с элементами [1, 2, 5, 9, 4, 13, 4, 10]. С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением,
//     равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.

// const arr = [1, 2, 5, 9, 4, 13, 4, 10]
// for(let i =0;i <= arr.length;i++)
//    if(arr[i] === 4){
//        console.log(`${arr[i]} есть`)
// }



